import Services from "@/components/services";

const Aboutus = () => {
  return (
    <>
      <div className="p-5 xl:p-10 w-full">
        <h4 className="text-2xl lg:text-3xl my-5 xl:my-10 text-center text-[var(--color-secondary)]">
          دربـــــاره کفشت
        </h4>
        <p className="mb-20 text-sm xl:text-md">
          بدون شک، این یک فضای بی‌نظیر برای شماست تا اینجا بیایید. ما افتخار
          داریم که به عنوان یک مقصد برای عاشقان کفش‌های با کیفیت و طراحی‌های
          بی‌نظیر، به شما خوش آمد می‌گوییم.
          <br />
          در آرزوی ایجاد یک تجربه خرید بی‌نظیر و منحصربه‌فرد برای شما، ما با
          افتخار به شما این امکان را می‌دهیم تا از مجموعه‌ای از برندهای معتبر در
          دنیای کفش استفاده کنید. از لحظه‌ای که وارد فضای ما می‌شوید، شما با
          تنوع و جذابیت طراحی‌ها و سبک‌های مختلف مواجه خواهید شد که هر یک از
          آنها دارای یک داستان و زیبایی خاصی است.
          <br />
          اما ما در اینجا تنها محدود به ارائه کفش‌هایی از برندهای معتبر نیستیم.
          با افتخار اعلام می‌کنیم که به شما امکان سفارشی‌سازی کفش‌های خود را با
          طرح‌ها و رنگ‌های دلخواهتان می‌دهیم. این امکان به شما این فرصت را
          می‌دهد که یک جفت کفش کاملاً منحصربه‌فرد و به سلیقه شما ایجاد کنید. از
          طرح‌های شگفت‌انگیز گرفته تا رنگ‌های جذاب، همه چیز در اختیار شماست تا
          کفش‌هایی را با امضای شخصی و طراحی‌هایی که تنها به شما تعلق دارد، داشته
          باشید.
          <br />
          همچنین، در ماموریت ما برای ارائه بهترین خدمات، ما به عنوان یک تیم
          متعهد و حرفه‌ای در اینجا هستیم تا به شما در هر مرحله از انتخاب و خرید
          کمک کنیم. از توضیحات دقیق درباره محصولات تا راهنمایی در انتخاب سایز
          مناسب، ما همیشه در کنار شما هستیم.
          <br />
          پس، به ما بپیوندید و به دنیایی از زیبایی، کیفیت و انتخابات بی‌نهایت
          خوش‌آمد بگویید. اینجا جایی است که شما می‌توانید باور خود را به اینکه
          کفش‌ها قدرتی بیشتر از یک اکسسوری است، تقویت کنید و به سبک زندگی خود
          رنگ و جلوه
        </p>

        <Services />
      </div>
    </>
  );
};

export default Aboutus;
