import Services from "@/components/services";

const Faq = () => {
  const faq_items = [
    {
      question: "چطوری می تونم سفارشم رو ثبت کنم؟",
      answer: `
    شما برای ثبت سفارش و خرید از فروشگاه اینترنتی کفشت بعد از اینکه کالای مورد نظرتون رو انتخاب کردید، اون رو به سبد خریدتون اضافه و به ترتیب مراحل خرید اینترنتی رو تکمیل کنید .\n
جهت ثبت سفارش باید در سایت ثبت‌نام کرده باشید یا اینکه در حین خرید، مراحل ثبت نام رو تکمیل کنید .\n
لطفا حواستون باشه اطلاعات تماس و ایمیلتون رو صحیح وارد کنید تا بتونید از ثبت سفارش و مراحل ارسالش آگاه بشید.\n
دقت کنید که آدرس مورد نظرتون برای دریافت کالا را درست و دقیق ثبت کرده باشید. از تعداد کالا و مبلغ نهایی سفارشتون هم مطمئن شید.\n
اکنون سفارش شما ثبت شده است!
`,
    },
    {
      question: "چگونه می ‌تونم سفارشم رو لغو کنم؟",
      answer: `
    اگر اشتباهی سفارشی رو ثبت کنید، لغو تا قبل از اینکه به دست پست برسه، امکان پذیره.
`,
    },
    {
      question: "آیا امکان بازگردوندن یا تعویض کالا وجود داره؟",
      answer: `
    خیر. متاسفانه محصولات وبسایت کفشت قابل برگشت و تعویض نیستند.
`,
    },
    {
      question:
        "در صورتی که پرداخت اینترنتی ناموفق باشه و مبلغ پرداخت شده از حسابم کم بشه باید چکار کنم؟",
      answer: `
    گاهی ممکنه در هنگام پرداخت آنلاین، شبکه‌ی بانکی قطع بشه یا به دلایل دیگه‌ای پرداخت ناموفقی انجام بگیره،معمولا پول شما در حساب‌های میانیِ بانکیه. و خود بانک مغایرت رو برطرف کرده و اون مبلغ رو به حسابتون برمی‌گردونه. در صورتی که پس از ۷۲ ساعت مبلغِ کسر شده به حسابتون بازگشت نخورد، با بانک عامل پرداخت اینترنتی تماس بگیرید تا مغایرت برطرف بشه.
`,
    },
    {
      question: "آیا در تمام ساعات شبانه روز می‌ توانم سفارش خود را ثبت کنم؟",
      answer: `
    بله بله! در ۲۴ ساعت شبانه روز و ۷ روز هفته می‌ تونید سفارشتون رو ثبت‌ کنید. (لطفا توجه داشته باشید سفارش‌هایی که در ساعات و روز‌های غیر‌کاری ثبت بشن، در اولین روز کاری بعدی بر اساس الویت مورد پردازش قرار می‌گیرند.)`,
    },
    {
      question: "پس از ثبت سفارش چقدر طول می‌کشه تا سفارش به دستم برسه؟",
      answer: `
    سفارش شما طی ۲ تا ۵ روز کاری پس از تحویل سفارش به شرکت پستی، به دستتون می‌رسه.
`,
    },
    {
      question: "آیا ارسال برای شهرستان‌ها هم امکان پذیره؟",
      answer: `
بله حتما! هم از طریق اضافه کردن آدرس در پروفایل شخصی، هم زمانِ نهایی کردنِ سبد خرید، می‌تونید استان و شهرستان خودتون رو انتخاب کنید.
`,
    },
  ];

  return (
    <>
      <div className="p-5 xl:p-10 w-full">
        <h4 className="text-2xl lg:text-3xl my-5 xl:my-10 text-center text-[var(--color-secondary)]">
          سوالات متداول از کفشت
        </h4>
        <p className="mb-20 text-sm xl:text-md">
          در اینجا به برخی از پرسش‌ها و مشکلات رایج که ممکن است در ذهن شما باشد،
          پاسخ داده‌ایم. برای راحتی و سرعت در یافتن پاسخ به سوالات خود، از
          بخش‌های زیر استفاده کنید:
          <br />
          اگر پاسخ به سوالتان را در اینجا نیافتید، ما همیشه آماده هستیم تا به
          شما کمک کنیم. لطفاً با ما تماس بگیرید یا به بخش تماس با ما مراجعه
          کنید.
        </p>

        <div className="mb-14">
          {faq_items.map((faq, idx) => (
            <div
              className="collapse collapse-arrow rounded-md border-2 mt-3"
              key={idx}
            >
              <input type="radio" name="my-accordion-2" />
              <div className="collapse-title text-sm xl:text-md font-medium">
                {faq.question}
              </div>
              <div className="collapse-content">
                <p className="text-xs xl:text-md">{faq.answer}</p>
              </div>
            </div>
          ))}
        </div>

        <Services />
      </div>
    </>
  );
};

export default Faq;
